/*
Modules:

Що таке модулі в JS:

Модулі - це спосіб організації коду, який дозволяє розділяти код на незалежні частини. Кожен модуль має власну область видимості і може експортувати або імпортувати функції, змінні або класи.
*/

/*
Які переваги надає їх використання:

1. Чистіша і організованіша структура коду.
2. Легше підтримувати та тестувати.
3. Уникає глобального простору імен, зменшує ризик конфліктів.
4. Підтримка повторного використання коду.
*/

/*
Яким чином можна експортувати елементи:

1. Іменовані експорти:
   export const myVar = 42;
   export function myFunc() { }

2. Експорт за замовчуванням:
   export default function() { }
*/

/*
Яким чином можна імпортувати всі доступні елементи з модуля:

import * as moduleName from './module.js';
*/

/*
Яка особливість export default:

export default дозволяє експортувати один елемент як основний експорт модуля. При імпорті можна дати цьому елементу будь-яке ім'я:
   export default function myFunc() { }
   // імпорт
   import myFunction from './module.js';
*/
